app/controllers/alliances_controller.rb

  def index
    @alliances = Alliance.by_name.paginate :page => params[:page]
---
SELECT * FROM `alliances`